RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
//#include <Arduino.h>
#include <algorithm>

#include "esp_camera.h"
//#include "EEPROM.h"
#include "esp_log.h"
#include "nvs_flash.h"
#include "esp_event.h"
#include "esp_wifi.h"
#include <driver/adc.h>
#include "esp_adc_cal.h"
#include "esp_wifi_types.h"
#include "driver/sdmmc_host.h"
#include "driver/sdmmc_defs.h"
#include "sdmmc_cmd.h"
#include "esp_vfs_fat.h"
//#include "esp_wifi_internal.h"
#include "esp_heap_caps.h"
#include "esp_task_wdt.h"
#include "esp_private/wifi.h"
#include "esp_task_wdt.h"
#include "esp_timer.h"
//#include "bt.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "driver/uart.h"
#include <unistd.h>
#include <fcntl.h>
#include "esp_random.h"

#include "fec_codec.h"
#include "packets.h"
#include "safe_printf.h"
#include "structures.h"
#include "crc.h"
#include "driver/gpio.h"
#include "main.h"
#include "queue.h"
#include "circular_buffer.h"

#include "ll_cam.h" // cam_obj_t defination, used in camera_data_available

#include "wifi.h"
#include "nvs_args.h"

#include "osd.h"
#include "msp.h"
#include "avi.h"

#include "vcd_profiler.h"

#include "jpeg_parser.h"
#include "util.h"

#include "hx_mavlink_parser.h"

#include "temperature_sensor.h"

static int s_stats_last_tp = -10000;
static int s_last_osd_packet_tp = -10000;

#define MJPEG_PATTERN_SIZE 512 

/////////////////////////////////////////////////////////////////////////

static size_t s_video_frame_data_size = 0;
static uint32_t s_video_frame_index = 0;
static uint8_t s_video_part_index = 0;
static bool s_video_frame_started = false;
static size_t s_video_full_frame_size = 0;
static uint8_t s_osdUpdateCounter = 0;
static bool s_lastByte_ff = false;

static int s_actual_capture_fps = 0;
static int s_actual_capture_fps_expected = 0;

static int s_quality = 20;
static float s_quality_framesize_K1 = 0; //startup from minimum quality to decrease pressure
static float s_quality_framesize_K2 = 1;
static float s_quality_framesize_K3 = 1;
static int s_max_frame_size = 0;
static int s_sharpness = 20;

static int64_t s_video_last_sent_tp = esp_timer_get_time();
static int64_t s_video_target_frame_dt = 0;
static uint8_t s_max_wlan_outgoing_queue_usage = 0;
static uint8_t s_min_wlan_outgoing_queue_usage_seen = 0;

static int64_t s_last_seen_config_packet = esp_timer_get_time();;

static int64_t s_restart_time = 0;
static int64_t s_wifi_ovf_time = 0;

extern WIFI_Rate s_wlan_rate;

static bool SDError = false;
static uint16_t SDTotalSpaceGB16 = 0;
static uint16_t SDFreeSpaceGB16 = 0;
static uint8_t cam_ovf_count = 0;

int32_t s_dbg;
uint16_t s_framesCounter = 0;

static bool s_initialized = false;

#ifdef UART_MAVLINK

//constexpr size_t MAX_TELEMETRY_PAYLOAD_SIZE = AIR2GROUND_MTU - sizeof(Air2Ground_Data_Packet);
//constexpr size_t MAX_TELEMETRY_PAYLOAD_SIZE = 512;
constexpr size_t MAX_TELEMETRY_PAYLOAD_SIZE = 128;

static uint8_t s_mavlink_out_buffer[MAX_TELEMETRY_PAYLOAD_SIZE];
static int s_mavlinkOutBufferCount = 0;
#endif
/////////////////////////////////////////////////////////////////////////

static int s_uart_verbose = 1;

#define LOG(...) do { if (s_uart_verbose > 0) SAFE_PRINTF(__VA_ARGS__); } while (false) 

/////////////////////////////////////////////////////////////////////////

sdmmc_card_t* card = nullptr;

static bool s_air_record = false;

static bool s_camera_stopped = false;
static bool s_camera_stopped_requested = false;

static uint64_t s_shouldRestartRecording;

#ifdef MAV2MSPRC
 HXMavlinkParser mavlinkParserIn(true);
#endif 

//=============================================================================================
//=============================================================================================
void initialize_status_led()
{
#ifdef STATUS_LED_PIN
    gpio_config_t io_conf;
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_OUTPUT;
    io_conf.pin_bit_mask = 1ULL << STATUS_LED_PIN;
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    io_conf.pull_up_en = GPIO_PULLUP_DISABLE;
    gpio_config(&io_conf);
    gpio_set_level(STATUS_LED_PIN, STATUS_LED_OFF);
#endif    
}

static bool s_last_flash_led_state = true;

//=============================================================================================
//=============================================================================================
void enable_esp32cam_flash_led_pin( bool enabled )
{
#ifdef ESP32CAM_FLASH_LED_PIN
    gpio_set_level(ESP32CAM_FLASH_LED_PIN, enabled ? 0: 1 );
    s_last_flash_led_state = enabled;
#endif
}

//=============================================================================================
//=============================================================================================
void initialize_esp32cam_flash_led_pin( bool enabled )
{
#ifdef ESP32CAM_FLASH_LED_PIN
    gpio_config_t io_conf;
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_OUTPUT;
    io_conf.pin_bit_mask = 1ULL << ESP32CAM_FLASH_LED_PIN;
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    io_conf.pull_up_en = GPIO_PULLUP_DISABLE;
    gpio_config(&io_conf);

    gpio_set_level(ESP32CAM_FLASH_LED_PIN, enabled ? 0: 1 );
    s_last_flash_led_state = enabled;
#endif
}

//=============================================================================================
//=============================================================================================
bool read_esp32cam_flash_led_pin()
{
#ifdef ESP32CAM_FLASH_LED_PIN
    gpio_set_direction((gpio_num_t)ESP32CAM_FLASH_LED_PIN, GPIO_MODE_INPUT );
    gpio_set_pull_mode((gpio_num_t)ESP32CAM_FLASH_LED_PIN, GPIO_PULLDOWN_ONLY); 
    gpio_set_level((gpio_num_t)ESP32CAM_FLASH_LED_PIN,0);

    bool state = gpio_get_level((gpio_num_t)ESP32CAM_FLASH_LED_PIN) == 1;

    gpio_set_level((gpio_num_t)ESP32CAM_FLASH_LED_PIN, s_last_flash_led_state ? 0 : 1);
    gpio_set_pull_mode((gpio_num_t)ESP32CAM_FLASH_LED_PIN, GPIO_FLOATING); 
    gpio_set_direction((gpio_num_t)ESP32CAM_FLASH_LED_PIN, GPIO_MODE_OUTPUT );
    
    return state;
#else    
    return false;
#endif
}

//=============================================================================================
//=============================================================================================
void initialize_flash_led_pin_button()
{
#ifdef ESP32CAM_FLASH_LED_PIN
    gpio_config_t io_conf;
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_OUTPUT;
    io_conf.pin_bit_mask = 1ULL << ESP32CAM_FLASH_LED_PIN;
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    io_conf.pull_up_en = GPIO_PULLUP_DISABLE;
    gpio_config(&io_conf);

