RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    gpio_set_level(ESP32CAM_FLASH_LED_PIN, 0 );
#endif
}

//=============================================================================================
//=============================================================================================
void initialize_rec_button()
{
#ifdef REC_BUTTON_PIN
    printf("Init REC button...\n");

    gpio_config_t io_conf;
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_INPUT;
    io_conf.pin_bit_mask = 1ULL << REC_BUTTON_PIN;
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    io_conf.pull_up_en = GPIO_PULLUP_ENABLE;
    gpio_config(&io_conf);
#endif
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR uint64_t micros()
{
    return esp_timer_get_time();
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR uint64_t millis()
{
    return esp_timer_get_time() / 1000ULL;
}

//=============================================================================================
//=============================================================================================
void set_status_led(bool enabled)
{
#ifdef STATUS_LED_PIN
    gpio_set_level(STATUS_LED_PIN, enabled ? STATUS_LED_ON : STATUS_LED_OFF);
#endif    

#ifdef ESP32CAM_FLASH_LED_PIN
    enable_esp32cam_flash_led_pin(enabled);
#endif    
}

//=============================================================================================
//=============================================================================================
void update_status_led()
{
 /*
  if ( cameraInitError )
  {
    bool b = (millis() & 0x7f) > 0x40;
    b &= (millis() & 0x7ff) > 0x400;
    digitalWrite( LED_PIN, b ? LOW : HIGH);
    digitalWrite( 4, b ? HIGH : LOW);
    return;
  }

  if ( initError )
  {
    bool b = (millis() & 0x7f) > 0x40;
    digitalWrite( LED_PIN, b ? LOW : HIGH);
    digitalWrite( 4, b ? HIGH : LOW);
    return;
  }
*/
  if (s_air_record)
  {
    bool b = (millis() & 0x7ff) > 0x400;
    set_status_led(b);
  }
  else
  {
#ifdef DVR_SUPPORT    
    set_status_led(true);
#else
    bool b = (millis() & 0x7ff) > 0x400;
    set_status_led(b);
#endif
  }
}

//=============================================================================================
//=============================================================================================
void update_status_led_file_server()
{
    bool b = (millis() & 0x2ff) > 0x180;
    set_status_led(b);
}

//=============================================================================================
//=============================================================================================
bool getButtonState()
{
#ifdef REC_BUTTON_PIN
    return gpio_get_level((gpio_num_t)REC_BUTTON_PIN) == 0;
#endif


#ifdef ESP32CAM_FLASH_LED_PIN
    return read_esp32cam_flash_led_pin();
#endif

    return false;
}

//=============================================================================================
//=============================================================================================
void checkButton()
{
  static uint32_t debounceTime = millis() + 100;
  static bool lastButtonState = false;

  if ( debounceTime > millis() ) return;
  bool buttonState = getButtonState();
  debounceTime = millis() + 10;
  if ( buttonState != lastButtonState )
  {
    debounceTime = millis() + 100;
    lastButtonState = buttonState;

    if ( buttonState )
    {
        if ( s_restart_time == 0 )
        {
#if defined(ENABLE_PROFILER) && defined (START_PROFILER_WITH_BUTTON)
            if ( s_profiler.isActive())
            {
                LOG("Profiler stopped!\n");
                s_profiler.stop();
                s_profiler.save();
                s_profiler.clear();
            }
            else
            {
                LOG("Profiler started!\n");
                s_profiler.start(1000);
            }
#else
            s_air_record = !s_air_record;
#endif            
        }
        LOG("Button pressed!\n");
    }
    else
    {
        LOG("Button unpressed!\n");
    }
  }
}

//////////////////////////////////////////////////////////////////////////////
static bool s_recv_ground2air_packet = false;

SemaphoreHandle_t s_serial_mux = xSemaphoreCreateBinary();

auto _init_result2 = []() -> bool
{
  xSemaphoreGive(s_serial_mux);
  return true;
}();


//=============================================================================================
//=============================================================================================
void init_failure()
{
    printf("INIT FAILURE!\n");
    
    initialize_status_led();
    while( true )
    {
        //esp_task_wdt_reset();

        bool b = (millis() & 0x7f) > 0x40;
        set_status_led(b);
    }
}

#ifdef DVR_SUPPORT

SemaphoreHandle_t s_sd_fast_buffer_mux = xSemaphoreCreateBinary();
SemaphoreHandle_t s_sd_slow_buffer_mux = xSemaphoreCreateBinary();

////////////////////////////////////////////////////////////////////////////////////

static TaskHandle_t s_sd_write_task = nullptr;
static TaskHandle_t s_sd_enqueue_task = nullptr;
static bool s_sd_initialized = false;
static size_t s_sd_file_size = 0;
static uint32_t s_sd_next_session_id = 0;
static uint32_t s_sd_next_segment_id = 0;


//the fast buffer is RAM and used to transfer data quickly from the camera callback to the slow, SPIRAM buffer. 
//Writing directly to the SPIRAM buffer is too slow in the camera callback and causes lost frames, so I use this RAM buffer and a separate task (sd_enqueue_task) for that.
static constexpr size_t SD_FAST_BUFFER_SIZE = 8192;
Circular_Buffer s_sd_fast_buffer((uint8_t*)heap_caps_malloc(SD_FAST_BUFFER_SIZE, MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL), SD_FAST_BUFFER_SIZE);

//this slow buffer is used to buffer data that is about to be written to SD. The reason it's this big is because SD card write speed fluctuated a lot and 
// sometimes it pauses for a few hundred ms. So to avoid lost data, I have to buffer it into a big enough buffer.
//The data is written to the sd card by the sd_write_task, in chunks of SD_WRITE_BLOCK_SIZE.
static constexpr size_t SD_SLOW_BUFFER_SIZE_PSRAM = 3 * 1024 * 1024;
Circular_Buffer* s_sd_slow_buffer = NULL;

//Cannot write to SD directly from the slow, SPIRAM buffer as that causes the write speed to plummet. So instead I read from the slow buffer into
// this RAM block and write from it directly. This results in several MB/s write speed performance which is good enough.
//ESP32S3: 2048  - ~1.2 MB/s
//ESP32S3: 6*512 - ~1.5 MB/s
//ESP32S3: 4096  - ~1.4...1.8 MB/s 
//ESP32S3: 10*512- ~1.9 MB/s
//ESP32S3: 8192  - 1.9...2.5 MB/s
//ESP32S3: 20*512- ~2.5 MB/s
//ESP32S3: 4096 SPI RAM - 0.38 MB/s

