RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
            case Resolution::XGA16:  //1024x576
#ifdef SENSOR_OV5640
                s->set_framesize(s, FRAMESIZE_P_FHD);
#else
                s->set_res_raw(s, 0/*OV2640_MODE_UXGA*/,0,0,0, 0, 150, 1600, 1200-300, 1024, 576, false, false);   //1024x576 13 fps
                
#endif
            break;
            case Resolution::SXGA: s->set_framesize(s, FRAMESIZE_SXGA); break;
            case Resolution::HD: s->set_framesize(s, FRAMESIZE_HD); break;
            case Resolution::UXGA: s->set_framesize(s, FRAMESIZE_UXGA); break;

            case Resolution::COUNT:
            break;

        }
    }

#define APPLY(n1, n2, type) \
    if (forceCameraSettings || (dst.camera.n1 != src.camera.n1)) \
    { \
        LOG("Camera " #n1 " from %d to %d\n", (int)dst.camera.n1, (int)src.camera.n1); \
        sensor_t* s = esp_camera_sensor_get(); \
        s->set_##n2(s, (type)src.camera.n1); \
    }

    if ( src.camera.quality != 0 )
    {
        APPLY(quality, quality, int);
        s_quality = src.camera.quality;
    }
    else
    {
        if ( forceCameraSettings )
        {
            sensor_t* s = esp_camera_sensor_get(); 
            s->set_quality(s, 20); 
        }
    }

    if ( dst.camera.agc != src.camera.agc)
    {
        //reapply agc gain if agc changed
        forceCameraSettings = true;
    }

    if ( dst.camera.aec != src.camera.aec)
    {
        //reapply aec value if aec changed
        forceCameraSettings = true;
    }

    APPLY(brightness, brightness, int);
    APPLY(contrast, contrast, int);
    APPLY(saturation, saturation, int);
    if ( s_quality < 50 )
    {
        APPLY(sharpness, sharpness, int);
        s_sharpness = src.camera.sharpness;
    }
    APPLY(denoise, denoise, int);
#ifdef SENSOR_OV5640
    //gainceiling for ov5640 is range 0...3ff
    if (forceCameraSettings || (dst.camera.gainceiling != src.camera.gainceiling)) 
    { 
        LOG("Camera gainceiling from %d to %d\n", (int)dst.camera.gainceiling, (int)src.camera.gainceiling); 
        sensor_t* s = esp_camera_sensor_get(); 
        //s->set_gainceiling(s, (gainceiling_t)(2 << src.camera.gainceiling));
        //do not limit gainceiling on OV5640. Contrary to OV2640, it does good images with large gain ceiling, without enormous noise in dark scenes.
        s->set_gainceiling(s, (gainceiling_t)(0x3ff));
    }
#else
    APPLY(gainceiling, gainceiling, gainceiling_t);
#endif
    APPLY(awb, whitebal, int);
    APPLY(awb_gain, awb_gain, int);
    APPLY(wb_mode, wb_mode, int);
    APPLY(agc, gain_ctrl, int);
    APPLY(agc_gain, agc_gain, int);
    APPLY(aec, exposure_ctrl, int);
    APPLY(aec_value, aec_value, int);
    APPLY(aec2, aec2, int);
    APPLY(ae_level, ae_level, int);
    APPLY(hmirror, hmirror, int);
    APPLY(vflip, vflip, int);
    APPLY(special_effect, special_effect, int);
    APPLY(dcw, dcw, int);
    APPLY(bpc, bpc, int);
    APPLY(wpc, wpc, int);
    APPLY(raw_gma, raw_gma, int);
    APPLY(lenc, lenc, int);
#undef APPLY

    dst = src;
}

//===========================================================================================
//===========================================================================================
IRAM_ATTR static void handle_ground2air_config_packet(Ground2Air_Config_Packet& src)
{
    //handle settings not related to camera sensor setup.
    //camera sensor settings are processed in camera_data_available() callback
    handle_ground2air_config_packetEx1(src);
}

static void init_camera();

//===========================================================================================
//===========================================================================================
IRAM_ATTR static void handle_ground2air_data_packet(Ground2Air_Data_Packet& src)
{
#ifdef UART_MAVLINK
    xSemaphoreTake(s_serial_mux, portMAX_DELAY);

    int s = src.size - sizeof(Ground2Air_Header);
    s_stats.in_telemetry_data += s;        

#ifdef MAV2MSPRC    
    uint8_t* dPtr = ((uint8_t*)&src) + sizeof(Ground2Air_Header);
    for ( int i = 0; i < s; i++ )
    {
        mavlinkParserIn.processByte(*dPtr++);
        if ( mavlinkParserIn.gotPacket())
        {
            if ( mavlinkParserIn.getMessageId() == HX_MAXLINK_RC_CHANNELS_OVERRIDE)
            {
                const HXMAVLinkRCChannelsOverride* msg = mavlinkParserIn.getMsg<HXMAVLinkRCChannelsOverride>();
                //LOG("%d %d %d %d\n", msg->chan1_raw, msg->chan2_raw, msg->chan3_raw, msg->chan4_raw);
                g_msp.setRCChannels((const uint16_t*)(&(msg->chan1_raw)));

                s_camera_stopped_requested = msg->chan12_raw > 1700;
            }
        }
    }
#endif

    size_t freeSize = 0;
    ESP_ERROR_CHECK( uart_get_tx_buffer_free_size(UART_MAVLINK, &freeSize) );

    if ( freeSize >= s )
    {
        uart_write_bytes(UART_MAVLINK, ((uint8_t*)&src) + sizeof(Ground2Air_Header), s);
        //uart_write_bytes(UART_NUM_0, ((uint8_t*)&src) + sizeof(Ground2Air_Header), s);
    }

    xSemaphoreGive(s_serial_mux);
#endif
}

//=============================================================================================
//=============================================================================================
IRAM_ATTR void send_air2ground_video_packet(bool last)
{
    s_stats.video_data += s_video_frame_data_size;

    uint8_t* packet_data = s_fec_encoder.get_encode_packet_data(true);

    if(!packet_data)
    {
        LOG("no data buf!\n");
    }

    Air2Ground_Video_Packet& packet = *(Air2Ground_Video_Packet*)packet_data;
    packet.type = Air2Ground_Header::Type::Video;
    packet.resolution = s_ground2air_config_packet.camera.resolution;
    packet.frame_index = s_video_frame_index;
    packet.part_index = s_video_part_index;
    packet.last_part = last ? 1 : 0;
    packet.size = s_video_frame_data_size + sizeof(Air2Ground_Video_Packet);
    packet.pong = s_ground2air_config_packet.ping;
    packet.version = PACKET_VERSION;
    packet.crc = 0;
    packet.crc = crc8(0, &packet, sizeof(Air2Ground_Video_Packet));
    if (!s_fec_encoder.flush_encode_packet(true))
    {
        LOG("Fec codec busy\n");
        s_stats.wlan_error_count++;
#ifdef PROFILE_CAMERA_DATA    
        s_profiler.toggle(PF_CAMERA_FEC_OVF);
#endif
    }
}

#ifdef UART_MAVLINK
//=============================================================================================
//=============================================================================================
//this currently called every frame: 50...11 fps
//30 fps: 30 * 128 = 3840 bytes/sec or 38400 baud
//11 fps: 11 * 128 - 1408 = 14080 baud
//todo: increase max mavlink payload size to 1K. Packets are 1.4K anyway. With 128 bytes we can not push 115200 mavlink stream currently.
//also UART RX ring buffer of 512 can not handle 115200 at 11 fps
IRAM_ATTR void send_air2ground_data_packet()
{
    int avail = MAX_TELEMETRY_PAYLOAD_SIZE - s_mavlinkOutBufferCount;
    if ( avail > 0 )
    {
        size_t rs = 0;
        ESP_ERROR_CHECK( uart_get_buffered_data_len(UART_MAVLINK, &rs) );
        if ( rs > avail ) rs = avail;

        if ( rs > 0 )
        {
            int len = uart_read_bytes(UART_MAVLINK, &(s_mavlink_out_buffer[s_mavlinkOutBufferCount]),rs, 0);
            if ( len < 0 )
            {
                LOG("MAVLNK COM error\n");
            }
            else
            {
                s_mavlinkOutBufferCount += len;
            }
        }
    }

