RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
                count -= c;
                s_video_frame_data_size += c;
                s_video_full_frame_size += c;

#ifdef PROFILE_CAMERA_DATA    
                s_profiler.set(PF_CAMERA_DATA_SIZE, s_video_full_frame_size / 1024);
#endif

#ifdef BOARD_ESP32CAM
                //ESP32 - sample offset: 2, stride: 4
                size_t c8 = c >> 3;
                
                for (size_t i = c8; i > 0; i--)
                {
                    const uint8_t* src1  = src + 3*4;
                    uint32_t temp;

                    temp = *src1; 
                    src1 -= 4;

                    temp = (temp << 8) | *src1;
                    src1 -= 4;

                    temp = (temp << 8) | *src1;
                    src1 -= 4;

                    temp = (temp << 8) | *src1;

                    *(uint32_t*)ptr = temp;
                    ptr += 4;

                    src1  = src + 7*4;

                    temp = *src1;
                    src1 -= 4;

                    temp = (temp << 8) | *src1;
                    src1 -= 4;

                    temp = (temp << 8) | *src1;
                    src1 -= 4;

                    temp = (temp << 8) | *src1;
                    
                    src += 8*4;

                    *(uint32_t*)ptr = temp;
                    ptr+=4;

                    /*
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    */
                }
                for (size_t i = c - (c8 << 3); i > 0; i--)
                {
                    *ptr++ = *src; src += stride;
                }
#endif

#ifdef BOARD_XIAOS3SENSE
                //ESP32S3 - sample offset: 0, stride: 1
                memcpy( ptr, src, c);
                src += c;
#endif

                if (s_video_frame_data_size == MAX_VIDEO_DATA_PAYLOAD_SIZE) 
                {
                    //LOG("Flush: %d %d\n", s_video_frame_index, s_video_frame_data_size);
                    //if wifi send queue was overloaded, do not send frame data till the end of the frame. 
                    //Frame is lost anyway. 
                    //Let fec_encoder and wifi to send leftover and start with emtpy queues at the next camera frame.
                    if (!s_encoder_output_ovf_flag)
                    { 
                        send_air2ground_video_packet(false);
                    }
                    s_video_frame_data_size = 0;
                    s_video_part_index++;
                }

                //LOG("Add: %d %d %d %d\n", s_video_frame_index, s_video_part_index, count, s_video_frame_data_size);

#ifdef DVR_SUPPORT
                if (s_air_record)
                {
#ifdef TEST_AVI_FRAMES
                    if ( s_video_full_frame_size == c )
                    {
                        s_framesCounter++;
                        start_ptr[14] = s_framesCounter & 0xff;
                        start_ptr[15] = s_framesCounter >> 8;
                    }
#endif            
                    add_to_sd_fast_buffer(start_ptr, c, false);
                }
#endif
            }  //while count>0
        }  //s_frame_started

        //////////////////

        if (last)  //note: can occur multiple times during frame
        {
            //end of frame - send leftover
            if ( s_video_frame_started )
            {
                s_video_frame_started = false;

                s_stats.video_frames++;
                s_stats.video_frames_expected++;

                //LOG("Finish: %d %d\n", s_video_frame_index, s_video_frame_data_size);
                if ((s_video_frame_data_size > 0) && !s_encoder_output_ovf_flag) //left over
                {
                    send_air2ground_video_packet(true);
                }

                if ( s_video_full_frame_size  < 2000)
                {
                    //probably broken frame - too small
                    cam_ovf_count++;
                    s_stats.video_frames_expected++;
                }

                //end of frame - stats, camera settings, osd, mavlink
                if ( s_video_full_frame_size > 0)
                {
                    if ( (s_stats.camera_frame_size_min == 0) || (s_stats.camera_frame_size_min > s_video_full_frame_size) )
                    {
                        s_stats.camera_frame_size_min = s_video_full_frame_size;
                    } 

                    if ( s_stats.camera_frame_size_max < s_video_full_frame_size )
                    {
                        s_stats.camera_frame_size_max = s_video_full_frame_size;
                    } 

                    recalculateFrameSizeQualityK(s_video_full_frame_size);
                    applyAdaptiveQuality();
#ifdef PROFILE_CAMERA_DATA    
                    s_profiler.set(PF_CAMERA_FRAME_QUALITY, s_quality);
#endif
                    s_stats.fec_spin_count += s_fec_spin_count;
                    s_fec_spin_count = 0;
#ifdef PROFILE_CAMERA_DATA    
                    s_profiler.set(PF_CAMERA_DATA_SIZE, 0);
#endif
                    handle_ground2air_config_packetEx2(false);

                    if ( !g_osd.isLocked() && (g_osd.isChanged() || (s_osdUpdateCounter == 15)) )
                    {
                        send_air2ground_osd_packet();
                        s_osdUpdateCounter = 0;
                    }
                    else
                    {
                        s_osdUpdateCounter++;
                    }

#ifdef UART_MAVLINK
                    send_air2ground_data_packet();
#endif
                }

                s_video_frame_index++;
            }
        }

        //zero start of the DMA block
        for ( int i = 0; i < 16; i++ )
        {
            *clrSrc = 0;
            clrSrc += stride;
        }

