RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
    //reinitialize rec button after configuring uarts
    initialize_rec_button();

    nvs_args_init();

    s_ground2air_config_packet.wifi_channel = (uint16_t)nvs_args_read("channel");
    if((s_ground2air_config_packet.wifi_channel < 1)  || (s_ground2air_config_packet.wifi_channel > 13))
    {
        s_ground2air_config_packet.wifi_channel = DEFAULT_WIFI_CHANNEL;
        nvs_args_set("channel", DEFAULT_WIFI_CHANNEL);
    }

    //allocates large continuous Wifi output bufer. Allocate ASAP until memory is not fragmented.
    setup_wifi(s_ground2air_config_packet.wifi_rate, s_ground2air_config_packet.wifi_channel, s_ground2air_config_packet.wifi_power, packet_received_cb);

    //allocates 16kb dma buffer. Allocate ASAP before memory is fragmented.
    init_camera();


#ifdef DVR_SUPPORT

#ifdef WRITE_RAW_MJPEG_STREAM 
#else
    prepAviBuffers();
#endif    

    xSemaphoreGive(s_sd_fast_buffer_mux);
    xSemaphoreGive(s_sd_slow_buffer_mux);

    init_sd();

    vTaskDelay(100 / portTICK_PERIOD_MS);

    //run file server i rec button is pressed on startup
    if ( getButtonState() )
    {
        LOG("Starting file server...");

        vTaskSuspend(s_wifi_rx_task);
        vTaskSuspend(s_wifi_tx_task);

        setup_wifi_file_server();

        while (true)
        {
            vTaskDelay(1);
            //esp_task_wdt_reset();

            update_status_led_file_server();
        }
    }

    s_shouldRestartRecording =  esp_timer_get_time() + 2000000;
    {
        int core = tskNO_AFFINITY;
        BaseType_t res = xTaskCreatePinnedToCore(&sd_write_proc, "SD Write", 4096, nullptr, 1, &s_sd_write_task, core);
        if (res != pdPASS)
        {
            LOG("Failed sd write task: %d\n", res);
        }
    }
    {
        int core = tskNO_AFFINITY;
        BaseType_t res = xTaskCreatePinnedToCore(&sd_enqueue_proc, "SD Enq", 1536, nullptr, 1, &s_sd_enqueue_task, core);
        if (res != pdPASS)
        {
            LOG("Failed sd enqueue task: %d\n", res);
        }
    }
#endif

#ifdef INIT_UART_1
    printf("Init UART1...\n");

    uart_config_t uart_config1 = 
    {
        .baud_rate = UART1_BAUDRATE,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .rx_flow_ctrl_thresh = 122,
        .source_clk = UART_SCLK_APB
    };  

    ESP_ERROR_CHECK(uart_param_config(UART_NUM_1, &uart_config1) );
    ESP_ERROR_CHECK(uart_driver_install(UART_NUM_1, UART1_RX_BUFFER_SIZE, UART1_TX_BUFFER_SIZE, 0, NULL, 0));
    ESP_ERROR_CHECK(uart_set_pin(UART_NUM_1, TXD1_PIN, RXD1_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE));

#endif

//initialize UART2 after SD
#ifdef INIT_UART_2
    printf("Init UART2...\n");

    uart_config_t uart_config2 = 
    {
        .baud_rate = UART2_BAUDRATE,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .rx_flow_ctrl_thresh = 122,
        .source_clk = UART_SCLK_APB
    };  

    ESP_ERROR_CHECK(uart_param_config(UART_NUM_2, &uart_config2) );
    ESP_ERROR_CHECK(uart_driver_install(UART_NUM_2, UART2_RX_BUFFER_SIZE, UART2_TX_BUFFER_SIZE, 0, NULL, 0));
    ESP_ERROR_CHECK(uart_set_pin(UART_NUM_2, TXD2_PIN, RXD2_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE));
#endif

    printf("MEMORY Before Loop: \n");
    heap_caps_print_heap_info(MALLOC_CAP_8BIT);
    heap_caps_print_heap_info(MALLOC_CAP_EXEC);

    handle_ground2air_config_packetEx1( s_ground2air_config_packet);
    handle_ground2air_config_packetEx2( true);
    set_ground2air_config_packet_handler(handle_ground2air_config_packet);
    set_ground2air_data_packet_handler(handle_ground2air_data_packet);

    LOG("WIFI channel: %d\n", s_ground2air_config_packet.wifi_channel );

    temperature_sensor_init();

    s_initialized = true;

    while (true)
    {
        int dt = millis() - s_stats_last_tp;
        if (dt >= 1000)
        {
            s_stats_last_tp = millis();

            s_actual_capture_fps = (int)(s_stats.video_frames)* 1000 / dt;
            s_actual_capture_fps_expected = (int)(s_stats.video_frames_expected)* 1000 / dt;
            s_max_wlan_outgoing_queue_usage = getMaxWlanOutgoingQueueUsage();
            s_min_wlan_outgoing_queue_usage_seen = getMinWlanOutgoingQueueUsageSeen();
            
            s_stats.wlan_error_count += s_fec_wlan_error_count;
            s_fec_wlan_error_count = 0;

            if (s_uart_verbose > 0 )
            {
                LOG("WLAN S: %d, R: %d, E: %d, F: %d, D: %d, %%: %d...%d || FPS: %d(%d), D: %d || SD D: %d, E: %d || TLM IN: %d OUT: %d || SK1: %d SK2: %d, SK3: %d, Q: %d s: %d ovf:%d %d\n",
                    s_stats.wlan_data_sent, s_stats.wlan_data_received, s_stats.wlan_error_count, s_stats.fec_spin_count,
                    s_stats.wlan_received_packets_dropped, s_min_wlan_outgoing_queue_usage_seen, s_max_wlan_outgoing_queue_usage, 
                    s_actual_capture_fps, s_actual_capture_fps_expected, s_stats.video_data, s_stats.sd_data, s_stats.sd_drops, 
                    s_stats.in_telemetry_data, s_stats.out_telemetry_data,
                    (int)(s_quality_framesize_K1*100),  (int)(s_quality_framesize_K2*100), (int)(s_quality_framesize_K3*100), 
                    s_quality, (s_stats.camera_frame_size_min + s_stats.camera_frame_size_max)/2, cam_ovf_count, s_dbg); 
                print_cpu_usage();
            }

            s_max_frame_size = 0;
            s_dbg = 0;

            if ( s_stats.fec_spin_count > 0 )
            {
                s_wifi_ovf_time = esp_timer_get_time();
            }

            s_last_stats = s_stats;
            s_stats = Stats();

            float t;
            temperature_sensor_read(&t);

            if ( s_camera_stopped_requested != s_camera_stopped )
            {
                s_camera_stopped = s_camera_stopped_requested;
                if ( s_camera_stopped )
                {
                    LOG("Camera stopped\n");
                    esp_camera_deinit();
                }
                else
                {
                    LOG("Camera started\n");
                    init_camera();
                }
            }
        }

        dt = millis() - s_last_osd_packet_tp;
        if ( dt > 200 ) 
        {
            s_last_osd_packet_tp = millis();
            
            if ( s_camera_stopped )
            {
                s_fec_encoder.lock();

                if ( !g_osd.isLocked() && (g_osd.isChanged() || (s_osdUpdateCounter == 15)) )
                {
                    send_air2ground_osd_packet();
                    s_osdUpdateCounter = 0;
                }
                else
                {
                    s_osdUpdateCounter++;
                }
                
