RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
                s_fec_encoder.unlock();
            }
        }

        vTaskDelay(10 / portTICK_PERIOD_MS);
        //esp_task_wdt_reset();

        checkButton();

        update_status_led();

#ifdef ENABLE_PROFILER
        if ( s_profiler.full() || s_profiler.timedOut() )
        {
            LOG("Profiler stopped!\n");
            s_profiler.stop();
            s_profiler.save();
            s_profiler.clear();
        } 
#endif

/*
#ifdef UART_MAVLINK
        xSemaphoreTake(s_serial_mux, portMAX_DELAY);

        if ( s_video_frame_data_size == 0 &&  s_video_part_index == 0 )
        {
            while ( true )
            {
                size_t rs = 0;

                LOG("%d\n", rs);

                //if (rs >= MAX_TELEMETRY_PAYLOAD_SIZE) //TODO: or rs>0 and >agregation time
                if (rs >= 1) //TODO: or rs>0 and >agregation time
                {
                    if (!send_air2ground_data_packet()) break;
                }
                else
                {
                    break;
                }
            }
        }

        xSemaphoreGive(s_serial_mux);
#endif
*/

#ifdef UART_MSP_OSD
        //msp.loop() should be called every ~10ms
        //115200 BAUD is 11520 bytes per second or 115 bytes per 10 ms
        //with UART RX buffer of 512 we are save with periods 10...40ms
        g_msp.loop();
#endif

        if ((s_restart_time!=0) && ( esp_timer_get_time()>s_restart_time))
        {
            esp_restart();
        }

    }

}

/*
Air receive:
1) packet_received_cb()- called by Wifi library when wifi packet is received
  - feeds data to s_fec_decoder.decode_data(). No data type checking at all.

2) s_fec_decoder.decode_data()
 - allocates item in m_decoder.packet_pool
 - concatenates small packets until mtu size (because wifi packets may be broken to smaller parts by wifi layer)
 - enquees packets into m_decoder.packet_queue

3) decoder_task_proc()  
 - retrives item from m_decoder.packet_queue
 - inserts either in m_decoder.block_packets or m_decoder.block_fec_packets
 - inserts into s_wlan_incoming_queue either received or restored packets
 - signals s_wifi_rx_task

4) s_wifi_rx_task
  - parses packets: Ground2Air_Header::Type::Config, Ground2Air_Header::Type::Data
 

Air send:
1) camera_data_available callback from camera library
 - send_air2ground_video_packet() - passes Air2Ground_Video_Packet to s_fec_encode.
 - flush_encode_packet() - concatenates data until mtu size and passes to m_encoder.packet_queue
 
 2) encoder_task_proc()
  - gathers packets in m_encoder.block_packets
  - calls fec_encode(()
  - add_to_wlan_outgoing_queue() - places encoded packets into s_wlan_outgoing_queue

3) wifi_tx_proc
 - reads s_wlan_outgoing_queue
 - calls esp_wifi_80211_tx() 

*/